In [1]:
import pandas as pd
import numpy as np

In [3]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve", "Alice"],
    "Age": [25, 30, 35, np.nan, 29, 25],
    "Department": ["HR", "IT", "Finance", "IT", "HR", "HR"],
    "Salary": [50000, 60000, 70000, 62000, np.nan, 50000]
}
df_1 = pd.DataFrame(data)
df_1

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [4]:
department_info = {
    "Department": ["HR", "IT", "Finance"],
    "Location": ["New York", "San Francisco", "Chicago"],
    "Manager": ["Laura", "Steve", "Nina"]
}
df_2 = pd.DataFrame(department_info)
df_2

  Department       Location Manager
0         HR       New York   Laura
1         IT  San Francisco   Steve
2    Finance        Chicago    Nina

In [7]:
# concat
pd.concat([df_1, df_2], axis=1)

      Name   Age Department   Salary Department       Location Manager
0    Alice  25.0         HR  50000.0         HR       New York   Laura
1      Bob  30.0         IT  60000.0         IT  San Francisco   Steve
2  Charlie  35.0    Finance  70000.0    Finance        Chicago    Nina
3    David   NaN         IT  62000.0        NaN            NaN     NaN
4      Eve  29.0         HR      NaN        NaN            NaN     NaN
5    Alice  25.0         HR  50000.0        NaN            NaN     NaN

In [ ]:
# merge 
pd.merge(df_1, df_2, on="Department")

      Name   Age Department   Salary       Location Manager
0    Alice  25.0         HR  50000.0       New York   Laura
1      Bob  30.0         IT  60000.0  San Francisco   Steve
2  Charlie  35.0    Finance  70000.0        Chicago    Nina
3    David   NaN         IT  62000.0  San Francisco   Steve
4      Eve  29.0         HR      NaN       New York   Laura
5    Alice  25.0         HR  50000.0       New York   Laura